
<!DOCTYPE HTML>
<html lang="zh-cn" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>多进程模型 · Python Server Tutorial</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="三月沙">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc/page-toc.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch04.html" />
    
    
    <link rel="prev" href="ch02.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ch00.html">
            
                <a href="ch00.html">
            
                    
                    写在开始之前
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    基础概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    最简单的 Web Server 模型
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    多进程模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    多线程模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    IO 多路复用技术
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    IO 多路复用之 poll
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    IO 多路复用之 select
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    IO 多路复用之 epoll
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    select、poll、epoll 如何选择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    C10k 问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    高性能 web server
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >多进程模型</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="3-&#x591A;&#x8FDB;&#x7A0B;&#x6A21;&#x578B;">3. &#x591A;&#x8FDB;&#x7A0B;&#x6A21;&#x578B;</h2>
<p>&#x591A;&#x8FDB;&#x7A0B;&#x6A21;&#x578B;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x5355;&#x4E2A;&#x8FDB;&#x7A0B;&#x65E2;&#x8981;&#x6267;&#x884C;&#x76D1;&#x542C;&#x5DE5;&#x4F5C;&#xFF0C;&#x53C8;&#x8981;&#x6267;&#x884C;&#x65B0; socket &#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E00;&#x4EBA;&#x5206;&#x9970;&#x4E24;&#x4E2A;&#x89D2;&#x8272;&#x7684;&#x4F4E;&#x6548;&#x800C;&#x8BDE;&#x751F;&#x7684;&#x3002;</p>
<h3 id="31-&#x591A;&#x8FDB;&#x7A0B;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF1F;">3.1 &#x591A;&#x8FDB;&#x7A0B;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF1F;</h3>
<p>&#x6BCF;&#x5F53;&#x6709;&#x65B0;&#x7684; connection &#x8FDB;&#x6765;&#xFF0C;&#x4FA6;&#x542C;&#x8FDB;&#x7A0B;&#x5728;&#x83B7;&#x5F97; connection &#x4E4B;&#x540E; fork &#x4E00;&#x4E2A;&#x65B0;&#x8FDB;&#x7A0B;&#x6765;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x65B0;&#x7684; connection&#xFF0C;&#x539F;&#x6709;&#x7684;&#x8FDB;&#x7A0B;&#x5C31;&#x4E0D;&#x5FC5;&#x7B49;&#x5F85;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x518D;&#x53BB;&#x7EE7;&#x7EED;&#x76D1;&#x542C;&#xFF0C;&#x800C;&#x662F;&#x5728; fork &#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#xFF0C;&#x8FD9;&#x6837;<strong>&#x76D1;&#x542C;&#x548C;&#x5904;&#x7406;&#x5C31;&#x5206;&#x5F00;&#x4E86;&#xFF0C;&#x5404;&#x53F8;&#x5176;&#x804C;</strong>&#x3002;
<img src="imgs/multiprocess-connection.jpg" alt=""></p>
<p>&#x5728; linux &#x4E2D;&#xFF0C;fork &#x51FA;&#x6765;&#x7684;&#x8FDB;&#x7A0B;&#x548C;&#x7236;&#x8FDB;&#x7A0B;&#x62E5;&#x6709;&#x540C;&#x6837;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;&#x3001;&#x5185;&#x5B58;&#x6570;&#x636E;&#x3001;&#x4E0E;&#x8FDB;&#x7A0B;&#x5173;&#x8054;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x7B49;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x4E2D;&#x5C31;&#x5305;&#x542B;&#x65B0;&#x6765;&#x7684; socket &#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x5B8C;&#x5168;&#x662F;&#x5728;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x6BB5;&#x4E0A;&#xFF0C;&#x76F8;&#x4E92;&#x4E0D;&#x5E72;&#x6270;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-comment"># create tcp socket</span>
s = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
<span class="hljs-comment"># enable reuse address port</span>
s.setsockopt(socket.SOL_SOCKET, socket.SO_REUSEADDR, <span class="hljs-number">1</span>)
<span class="hljs-comment"># bind socket to the port</span>
server_address = (<span class="hljs-string">&apos;localhost&apos;</span>, <span class="hljs-number">8000</span>)
s.bind(server_address)
s.listen(<span class="hljs-number">10</span>)
<span class="hljs-keyword">while</span> <span class="hljs-number">1</span>:
    print_green(<span class="hljs-string">&apos; waitting to recevie message from client&apos;</span>)
    connection, address = s.accept()
    <span class="hljs-keyword">if</span> <span class="hljs-keyword">not</span> os.fork():   <span class="hljs-comment"># enter child process</span>
        time.sleep(<span class="hljs-number">3</span>)   <span class="hljs-comment"># exec task in 3 seconds</span>
        msg = connection.recv(<span class="hljs-number">1024</span>)
        print_red(<span class="hljs-string">&quot;child process&quot;</span>)
        connection.send(msg.capitalize())
        connection.close()      <span class="hljs-comment"># close client socket</span>
        s.close()       <span class="hljs-comment"># child does not need this</span>
        <span class="hljs-keyword">break</span>           <span class="hljs-comment"># break child while loop</span>
    connection.close()      <span class="hljs-comment"># parent does not need this</span>
</code></pre>
<p>&#x5728;&#x591A;&#x8FDB;&#x7A0B;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x5B50;&#x8FDB;&#x7A0B;&#x662F;&#x62E5;&#x6709;&#x4E0E;&#x7236;&#x8FDB;&#x7A0B;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;&#xFF0C;&#x7531;&#x4E8E;&#x5B50;&#x8FDB;&#x7A0B;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#x53EA;&#x7528;&#x6765;&#x5904;&#x7406;&#x65B0;&#x7684; socket &#x8FDE;&#x63A5; &#x4E5F;&#x5C31;&#x662F; connection&#xFF0C;&#x6240;&#x4EE5;&#x5B50;&#x8FDB;&#x7A0B;&#x4E2D; copy &#x8FC7;&#x6765;&#x7684;&#x76D1;&#x542C; socket &#xFF08;&#x8D1F;&#x8D23; accept &#x7684;&#x5DE5;&#x4F5C;&#xFF09;&#x9700;&#x8981;&#x91CA;&#x653E;&#xFF0C;&#x800C;&#x4E14;&#x5B50;&#x8FDB;&#x7A0B;&#x5728;&#x5904;&#x7406;&#x5B8C;&#x6BD5;&#x65B0;&#x7684; connection &#x4E4B;&#x540E;&#x4E5F;&#x9700;&#x8981;&#x91CA;&#x653E;&#x81EA;&#x8EAB;&#x5360;&#x7528;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5373;&#x9000;&#x51FA;&#x5B50;&#x8FDB;&#x7A0B;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x591A;&#x8FDB;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x548C;&#x76D1;&#x542C;&#x8BF7;&#x6C42;&#x5C31;&#x5206;&#x5F00;&#x4E86;&#xFF0C;&#x8FD9;&#x6837; server &#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x5904;&#x7406;&#x591A;&#x4E2A;&#x5BF9;&#x8BDD;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5E38;&#x8BF4;&#x7684;<strong>&#x652F;&#x6301;&#x5E76;&#x53D1;&#xFF0C;&#x800C;&#x5E76;&#x53D1;&#x5C31;&#x662F;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x591A;&#x4E2A;&#x4E8B;&#x60C5;</strong>&#x3002;</p>
<p>&#x591A;&#x8FDB;&#x7A0B;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5E76;&#x53D1;&#x6A21;&#x578B;&#xFF0C;&#x5728;&#x73B0;&#x5B9E;&#x7684;&#x5E94;&#x7528;&#x5F53;&#x4E2D;&#x4E5F;&#x6709;&#x4E0D;&#x5C11;&#x5F00;&#x6E90;&#x5E93;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982; Python &#x4E2D;&#x8457;&#x540D;&#x7684;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x961F;&#x5217; <a href="http://python-rq.org/" target="_blank">RQ</a> &#xFF0C;&#x5176;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x5C31;&#x662F;&#x5BF9;&#x6BCF;&#x4E2A;&#x9700;&#x8981;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1; fork &#x65B0;&#x7684;&#x8FDB;&#x7A0B;&#x6765;&#x5904;&#x7406;&#x3002;</p>
<h3 id="32-&#x591A;&#x8FDB;&#x7A0B;&#x7684;&#x95EE;&#x9898;">3.2 &#x591A;&#x8FDB;&#x7A0B;&#x7684;&#x95EE;&#x9898;</h3>
<p>&#x591A;&#x8FDB;&#x7A0B;&#x80FD;&#x591F;&#x89E3;&#x51B3;&#x5355;&#x8FDB;&#x7A0B;&#x6A21;&#x578B;&#x4E2D;&#x4E0D;&#x80FD;&#x5E76;&#x53D1;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E14;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x76F4;&#x89C2;&#xFF0C;&#x540C;&#x6837;&#x591A;&#x8FDB;&#x7A0B;&#x4E5F;&#x6709;&#x5176;&#x81EA;&#x8EAB;&#x7684;&#x7F3A;&#x70B9;&#x3002;</p>
<h4 id="321-&#x6570;&#x636E;&#x5171;&#x4EAB;&#x590D;&#x6742;">3.2.1 &#x6570;&#x636E;&#x5171;&#x4EAB;&#x590D;&#x6742;</h4>
<p>&#x5728;&#x771F;&#x5B9E;&#x7684; Web Server &#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#x548C;&#x76D1;&#x542C;&#x5355;&#x5143;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5171;&#x4EAB;&#xFF0C;&#x6BD4;&#x5982; Web Server &#x7684;&#x67D0;&#x4E9B;&#x5168;&#x5C40;&#x72B6;&#x6001;(&#x8BBF;&#x95EE;&#x91CF;&#x7EDF;&#x8BA1;&#xFF0C;session &#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x767D;&#x540D;&#x5355;&#x9ED1;&#x540D;&#x5355;&#x7684;&#x8BBE;&#x7F6E;&#x7B49;)&#x53EF;&#x80FD;&#x4F1A;&#x56E0;&#x4E3A;&#x90E8;&#x5206;&#x8BF7;&#x6C42;&#x800C;&#x6539;&#x53D8;&#xFF0C;&#x5982;&#x679C; Web Server &#x662F;&#x591A;&#x8FDB;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x6B64;&#x65F6;&#x8FD9;&#x4E2A;&#x5171;&#x4EAB;&#x7684;&#x5168;&#x5C40;&#x72B6;&#x6001;&#x5C31;&#x5E94;&#x8BE5;&#x53CA;&#x65F6;&#x5468;&#x77E5; Web Server &#x4E2D;&#x6B63;&#x5728;&#x5904;&#x7406;&#x65B0; connection &#x7684;&#x6240;&#x6709;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x5728;&#x591A;&#x8FDB;&#x7A0B;&#x6A21;&#x578B;&#x4E2D;&#x5904;&#x7406;&#x7C7B;&#x4F3C;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x9700;&#x8981;<strong>&#x8FDB;&#x7A0B;&#x95F4;&#x7684;&#x901A;&#x4FE1;</strong>&#x3002;</p>
<p>&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x6709;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x6709;&#xFF1A;&#x4FE1;&#x53F7;&#x3001;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#xFF0C;&#x8FD8;&#x6709;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6B63;&#x5728;&#x8BA8;&#x8BBA;&#x7684; socket&#x3002;</p>
<p><strong>&#x4FE1;&#x53F7;</strong></p>
<p>&#x4FE1;&#x53F7;&#x662F; linux &#x4E2D;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x7684;&#x4E00;&#x79CD;&#x91CD;&#x8981;&#x624B;&#x6BB5;&#xFF0C;&#x4F46;&#x662F;&#x76F8;&#x6BD4;&#x5728; Web Server &#x4E2D;&#x9700;&#x8981;&#x4EA4;&#x6D41;&#x6C9F;&#x901A;&#x7684;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x6765;&#x8BF4;&#xFF0C;&#x7531;&#x4E8E; linux &#x4E2D;&#x7684;&#x4FE1;&#x53F7;&#x662F;&#x7531;&#x4E00;&#x7EC4;&#x6709;&#x9650;&#x7684;&#x4FE1;&#x53F7;&#x51FD;&#x6570;&#x7EC4;&#x6210;&#xFF0C;&#x4FE1;&#x53F7;&#x80FD;&#x591F;&#x8868;&#x8FBE;&#x548C;&#x53D1;&#x9001;&#x7684;&#x6570;&#x636E;&#x4FE1;&#x606F;&#x90FD;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3; Web Server &#x4E2D;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x5171;&#x4EAB;&#x9700;&#x6C42;&#x3002;</p>
<p><strong>&#x5171;&#x4EAB;&#x5185;&#x5B58;</strong></p>
<p>&#x5171;&#x4EAB;&#x5185;&#x5B58;&#xFF0C;&#x662F;&#x6307;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x5171;&#x4EAB;&#x4E00;&#x6BB5;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x76F8;&#x6BD4;&#x4FE1;&#x53F7;&#xFF0C;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x80FD;&#x591F;&#x63D0;&#x4F9B;&#x66F4;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x65B9;&#x5F0F;&#xFF1B;&#x4F46;&#x662F;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x5374;&#x6709;&#x4E00;&#x4E2A;&#x65E0;&#x6CD5;&#x5FFD;&#x89C6;&#x7684;&#x7F3A;&#x70B9;&#xFF1A;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x7684;&#x8BBF;&#x95EE;&#x7684;&#x5B89;&#x5168;&#x6027;&#x5FC5;&#x987B;&#x7531;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x4FDD;&#x8BC1;&#xFF0C;&#x56E0;&#x4E3A;<strong>&#x5B83;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x540C;&#x6B65;&#x673A;&#x5236;&#x6765;&#x4FDD;&#x8BC1;&#x540C;&#x4E00;&#x6BB5;&#x5185;&#x5B58;&#x4FE1;&#x606F;&#x88AB;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x8BBF;&#x95EE;&#x65F6;&#x7684;&#x8BFB;&#x5199;&#x5B89;&#x5168;</strong>&#x3002;</p>
<p><strong>socket</strong></p>
<p>&#x73B0;&#x5728;&#x5047;&#x8BBE;&#xFF0C;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#x548C;&#x76D1;&#x542C;&#x8FDB;&#x7A0B;&#x662F;&#x901A;&#x8FC7; socket &#x6765;&#x5171;&#x4EAB;&#x4E0A;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x76D1;&#x542C;&#x8FDB;&#x7A0B;&#x83B7;&#x53D6;&#x7684;&#x65B0;&#x7684; socket &#x53EF;&#x80FD;&#x662F;&#x6765;&#x81EA;&#x4E00;&#x4E2A;&#x81EA;&#x8EAB; fork &#x51FA;&#x6765;&#x7684;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x544A;&#x8BC9;&#x5B83;&#x4E00;&#x4E9B;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x7684;&#x53D8;&#x5316;&#x3002;&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x533A;&#x5206;&#x65B0;&#x5230;&#x7684; socket &#x662F;&#x6765;&#x81EA;&#x5B50;&#x8FDB;&#x7A0B;&#x8FD8;&#x662F;&#x5176;&#x4ED6;&#x7684;&#x6B63;&#x5E38;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#xFF0C;&#x76D1;&#x542C;&#x8FDB;&#x7A0B;&#x5FC5;&#x987B;&#x8981;&#x505A;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BD4;&#x5982;&#x6B63;&#x786E;&#x89E3;&#x6790;&#x6765;&#x81EA;&#x5B50;&#x8FDB;&#x7A0B;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x53CA;&#x65F6;&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x6B63;&#x5728;&#x5DE5;&#x4F5C;&#x7684;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x76D1;&#x542C;&#x8FDB;&#x7A0B;&#x53C8;&#x9700;&#x8981;&#x4FDD;&#x7559;&#x6240;&#x6709;&#x5DE5;&#x4F5C;&#x5B50;&#x8FDB;&#x7A0B;&#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x5728;&#x4EE5;&#x4FBF;&#x6570;&#x636E;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x65F6;&#x901A;&#x77E5;&#x5B83;&#x4EEC;&#x3002;&#x867D;&#x7136;&#x5230;&#x8FD9;&#x6B65;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5904;&#x7406;&#x7684;&#x5DE5;&#x4F5C;&#x8FD8;&#x8FDC;&#x672A;&#x7ED3;&#x675F;&#xFF0C;&#x4F46;&#x662F;&#x5DF2;&#x7ECF;&#x5230;&#x53EF;&#x4EE5;&#x611F;&#x53D7;&#x5230;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x590D;&#x6742;&#x6027;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x5B50;&#x8FDB;&#x7A0B;&#x8FD8;&#x9700;&#x8981;&#x548C;&#x7236;&#x8FDB;&#x7A0B;&#x4FDD;&#x6301;&#x8FDE;&#x63A5;&#x5E76;&#x4E14;&#x4FDD;&#x8BC1;&#x80FD;&#x968F;&#x65F6;&#x6536;&#x5230;&#x6765;&#x81EA;&#x7236;&#x8FDB;&#x7A0B;&#x7684;&#x901A;&#x77E5;&#x7B49;&#x7B49;&#x3002;</p>
<p>socket &#x7684;&#x6A21;&#x5F0F;&#x771F;&#x7684;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x4F7F;&#x7528; socket &#x6A21;&#x5F0F;&#x5C31;&#x50CF; Web Server &#x4E2D;&#x672C;&#x8EAB;&#x53C8;&#x9700;&#x8981;&#x4E00;&#x4E2A; Web Server &#x6765;&#x63A5;&#x7BA1;&#x548C;&#x5B50;&#x8FDB;&#x7A0B;&#x7684;&#x901A;&#x4FE1;&#xFF0C;&#x73B0;&#x5B9E;&#x4E2D;&#x8FD9;&#x90E8;&#x5206;&#x9700;&#x6C42;&#x5F80;&#x5F80;&#x6211;&#x4EEC;&#x4F1A;&#x501F;&#x52A9;&#x7B2C;&#x4E09;&#x65B9;&#x5DE5;&#x5177;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x6BD4;&#x5982; <a href="https://en.wikipedia.org/wiki/Message_queue" target="_blank">MQ</a>&#x3002; </p>
<h4 id="322-&#x80FD;&#x591F;&#x652F;&#x6301;&#x7684;&#x5E76;&#x53D1;&#x975E;&#x5E38;&#x6709;&#x9650;">3.2.2 &#x80FD;&#x591F;&#x652F;&#x6301;&#x7684;&#x5E76;&#x53D1;&#x975E;&#x5E38;&#x6709;&#x9650;</h4>
<p>&#x591A;&#x8FDB;&#x7A0B;&#x6A21;&#x578B;&#x9664;&#x4E86;&#x5E26;&#x6765;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x4EA4;&#x6D41;&#x7684;&#x590D;&#x6742;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x53D1;&#x91CF;&#x5927;&#x65F6;&#x8FD8;&#x4F1A;&#x5360;&#x7528;&#x5927;&#x91CF;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x3002;&#x5728; linux &#x4E2D;&#x6BCF;&#x591A;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5904;&#x7406;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5C31;&#x8981;&#x5206;&#x914D;&#x76F8;&#x5E94;&#x7684;&#x8D44;&#x6E90;&#x5BF9;&#x8FDB;&#x7A0B;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#xFF0C;&#x6BD4;&#x5982;&#x8FDB;&#x7A0B;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#xFF0C;&#x8FDB;&#x7A0B;&#x7684;&#x5524;&#x9192;&#x548C;&#x4E2D;&#x65AD;&#x7B49;&#xFF0C;&#x50F5;&#x6B7B;&#x8FDB;&#x7A0B;&#x7684;&#x5904;&#x7406;&#x7B49;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8BD5;&#x7740;&#x628A;&#x4F60;&#x7684; chrome &#x6D4F;&#x89C8;&#x5668;&#x6807;&#x7B7E;&#x9875;&#x5F00;&#x5230;&#x51E0;&#x5341;&#x4E2A;&#x4E0A;&#x767E;&#x4E2A;&#x611F;&#x53D7;&#x4E00;&#x4E0B;&#x591A;&#x8FDB;&#x7A0B;&#x5E26;&#x6765;&#x7684;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x3002;</p>
<p><img src="imgs/process_4_100.png" alt=""></p>
<p>&#x56FE;&#x4E2D;&#x662F;&#x8FDB;&#x7A0B;&#x6A21;&#x5F0F; Web Server &#x4E0B; 4 &#x4E2A; client&#xFF0C;&#x6BCF;&#x4E2A;&#x8BF7;&#x6C42;&#x95F4;&#x9694; 3s &#x53D1;&#x8D77;&#xFF0C;&#x6301;&#x7EED;&#x7EA6; 1 &#x5206;&#x949F;&#x5DE6;&#x53F3;&#x7684;&#x8BF7;&#x6C42;&#x5BFC;&#x81F4;&#x7684; server &#x7AEF; CPU &#x5229;&#x7528;&#x7387;&#x66F2;&#x7EBF;&#x3002;</p>
<p>&#x591A;&#x8FDB;&#x7A0B;&#x6A21;&#x578B;&#x5DF2;&#x7ECF;&#x80FD;&#x591F;&#x7B80;&#x5355;&#x7684;&#x652F;&#x6301;&#x5E76;&#x53D1;&#x4E86;&#xFF0C;&#x5374;&#x53C8;&#x5F15;&#x5165;&#x5176;&#x4ED6;&#x66F4;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x8FD8;&#x6709;&#x66F4;&#x597D;&#x7684;&#x673A;&#x5236;&#x4E48;&#xFF1F;&#x5F53;&#x7136;&#x6709;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x8BF4;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x6A21;&#x578B; Web Server&#x3002; </p>
<footer class="page-footer"><span class="copyright">&#xA9; &#x4E09;&#x6708;&#x6C99; all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">Updated at
2019-05-23 11:02:59
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch02.html" class="navigation navigation-prev " aria-label="Previous page: 最简单的 Web Server 模型">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch04.html" class="navigation navigation-next " aria-label="Next page: 多线程模型">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"多进程模型","level":"1.5","depth":1,"next":{"title":"多线程模型","level":"1.6","depth":1,"path":"book/ch04.md","ref":"book/ch04.md","articles":[]},"previous":{"title":"最简单的 Web Server 模型","level":"1.4","depth":1,"path":"book/ch02.md","ref":"book/ch02.md","articles":[]},"dir":"ltr"},"config":{"plugins":["mermaid","github","editlink","page-toc","-lunr","-search","search-plus","tbfed-pagefooter","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"&copy 三月沙","modify_label":"Updated at","modify_format":"YYYY-MM-DD HH:mm:ss"},"github":{"url":"https://github.com/zhyq0826/python-server-tutorial"},"editlink":{"label":"编辑本页","multilingual":false,"base":"https://github.com/zhyq0826/python-server-tutorial/blob/master"},"mermaid":{},"page-toc":{"position":"before-first","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3","showByDefault":true},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"ga":{"configuration":"auto","token":"UA-56212296-1"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"search-plus":{}},"theme":"default","author":"三月沙","pdf":{"pageNumbers":true,"fontSize":11,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56},"toc":true},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Python Server Tutorial","language":"zh-cn","gitbook":">= 3.2.2"},"file":{"path":"book/ch03.md","mtime":"2019-05-23T03:02:59.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-05-23T11:40:44.706Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc/anchor-3.1.1.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc/page-toc.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

